//--TASK 1-------------------------------------------------------
// Объяви две переменные, productName для названия товара и pricePerItem для хранения цены за штуку.
// При объявлении присвой переменным следующие характеристики товара:

// название - строка "Droid"
// цена за штуку - число 2000

// Change code below this line

// console.log(productName);
// 'Droid'

// console.log(pricePerItem);
// 2000

//--SOLUTION 1---------------------------------------------------
// // Change code below this line
// const productName = 'Droid';
// // console.log(productName);
// // 'Droid'
// const pricePerItem = 2000;
// // console.log(pricePerItem);
// // 2000


//--TASK 2-------------------------------------------------------
// Имя товара изменили на "Repair droid" и увеличили его цену на 1500 кредитов.
// Переопредели значения переменных pricePerItem и productName после их объявления.

// let productName = "Droid";
// let pricePerItem = 2000;

// // Change code below this line

//--SOLUTION 2---------------------------------------------------
// let productName = "Droid";
// let pricePerItem = 2000;

// // Change code below this line
// productName = "Repair droid";
// pricePerItem += 1500;


//--TASK 3-------------------------------------------------------
// Объяви следующие переменные используя ключевое слово const или let и присвой им соответствующие значения.

// topSpeed - число 160.
// distance - число 617.54.
// login - строка "mango935".
// isOnline - буль true.
// isAdmin - буль false.

// Change code below this line

//--SOLUTION 3---------------------------------------------------
// // Change code below this line
// let topSpeed = 160;
// let distance = 617.54;
// let login = "mango935";
// let isOnline = true;
// let isAdmin = false;

//--TASK 4-------------------------------------------------------
// Дополни код, присвоив переменной totalPrice выражение для подсчёта общей суммы заказа.
// Переменная pricePerItem хранит цену одной единицы товара, а orderedQuantity - количество единиц товара в заказе.

// const pricePerItem = 3500;
// const orderedQuantity = 4;

// // Change code below this line
// const totalPrice = pricePerItem;

//--SOLUTION 4---------------------------------------------------
// const pricePerItem = 3500;
// const orderedQuantity = 4;

// // Change code below this line
// const totalPrice = pricePerItem * orderedQuantity;


//--TASK 5-------------------------------------------------------
// Объяви перемнную message и запиши в неё сообщение о покупке, строку в формате:
// "You picked <имя товара>, price per item is <цена товара> credits".
// Где < имя товара > и < цена товара > это значения переменных productName и pricePerItem.
// Используй синтаксис шаблонных строк.

// const productName = "Droid";
// const pricePerItem = 3500;

// // Change code below this line

//--SOLUTION 5---------------------------------------------------
// const productName = "Droid";
// const pricePerItem = 3500;

// // Change code below this line
// const message = `You picked ${productName}, price per item is ${pricePerItem} credits`;


//--TASK 6-------------------------------------------------------


//--SOLUTION 6---------------------------------------------------



//--TASK 7-------------------------------------------------------


//--SOLUTION 7---------------------------------------------------



//--TASK 8-------------------------------------------------------


//--SOLUTION 8---------------------------------------------------



//--TASK 9-------------------------------------------------------


//--SOLUTION 9---------------------------------------------------



//--TASK 10-------------------------------------------------------


//--SOLUTION 10---------------------------------------------------



//--TASK 11-------------------------------------------------------


//--SOLUTION 11---------------------------------------------------




//--TASK 12-------------------------------------------------------


//--SOLUTION 12---------------------------------------------------



//--TASK 13-------------------------------------------------------


//--SOLUTION 13---------------------------------------------------




//--TASK 14-------------------------------------------------------


//--SOLUTION 14---------------------------------------------------




//--TASK 15-------------------------------------------------------


//--SOLUTION 15---------------------------------------------------




//--TASK 16-------------------------------------------------------


//--SOLUTION 16---------------------------------------------------




//--TASK 17-------------------------------------------------------


//--SOLUTION 17---------------------------------------------------



//--TASK 18-------------------------------------------------------


//--SOLUTION 18---------------------------------------------------



//--TASK 19-------------------------------------------------------


//--SOLUTION 19---------------------------------------------------



//--TASK 20-------------------------------------------------------


//--SOLUTION 20---------------------------------------------------



//--TASK 21-------------------------------------------------------


//--SOLUTION 21---------------------------------------------------




//--TASK 22-------------------------------------------------------


//--SOLUTION 22---------------------------------------------------




//--TASK 23-------------------------------------------------------


//--SOLUTION 23---------------------------------------------------




//--TASK 24-------------------------------------------------------


//--SOLUTION 24---------------------------------------------------




//--TASK 25-------------------------------------------------------


//--SOLUTION 25---------------------------------------------------




//--TASK 26-------------------------------------------------------


//--SOLUTION 26---------------------------------------------------




//--TASK 27-------------------------------------------------------


//--SOLUTION 27---------------------------------------------------



//--TASK 28-------------------------------------------------------


//--SOLUTION 28---------------------------------------------------




//--TASK 29-------------------------------------------------------


//--SOLUTION 29---------------------------------------------------



//--TASK 30-------------------------------------------------------


//--SOLUTION 30---------------------------------------------------




//--TASK 31-------------------------------------------------------


//--SOLUTION 31---------------------------------------------------




//--TASK 32-------------------------------------------------------


//--SOLUTION 32---------------------------------------------------




//--TASK 33-------------------------------------------------------


//--SOLUTION 33---------------------------------------------------




//--TASK 34-------------------------------------------------------


//--SOLUTION 34---------------------------------------------------




//--TASK 35-------------------------------------------------------


//--SOLUTION 35---------------------------------------------------




//--TASK 36-------------------------------------------------------


//--SOLUTION 36---------------------------------------------------














