// Модуль 5 - Ключевое слово this - Прототипы и классы
//--TASK 1--------------------------------------------------------------------------------------------------------------
// Выполни рефакторинг методов объекта pizzaPalace, расставив отсутствующие this в местах обращения к свойствам и методам объекта.

// const pizzaPalace = {
//   pizzas: ["Supercheese", "Smoked", "Four meats"],
//   // Change code below this line
//   checkPizza(pizzaName) {
//     return pizzas.includes(pizzaName);
//   },
//   order(pizzaName) {
//     const isPizzaAvailable = checkPizza(pizzaName);

//     if (!isPizzaAvailable) {
//       return `Sorry, there is no pizza named «${pizzaName}»`;
//     }

//     return `Order accepted, preparing «${pizzaName}» pizza`;
//   },
//   // Change code above this line
// };

//--SOLUTION 1---------------------------------------------------
// const pizzaPalace = {
//   pizzas: ["Supercheese", "Smoked", "Four meats"],
//   // Change code below this line
//   checkPizza(pizzaName) {
//     return this.pizzas.includes(pizzaName);
//   },
//   order(pizzaName) {
//     const isPizzaAvailable = this.checkPizza(pizzaName);

//     if (!isPizzaAvailable) {
//       return `Sorry, there is no pizza named «${pizzaName}»`;
//     }

//     return `Order accepted, preparing «${pizzaName}» pizza`;
//   },
//   // Change code above this line
// };


//--TASK 2--------------------------------------------------------------------------------------------------------------
// Перед увольнением разработчик сломал исходный код управления аккаунтами 
// пользователей нашего сервиса доставки еды.
// Выполни рефакторинг методов объекта customer, расставив отсутствующие
// this при обращении к свойствам объекта.

// После объявления объекта мы добавили вызовы методов в той
// последовательности, в которой твой код будут проверять тесты.
// Пожалуйста ничего там не меняй.

// const customer = {
//   username: "Mango",
//   balance: 24000,
//   discount: 0.1,
//   orders: ["Burger", "Pizza", "Salad"],
//   // Change code below this line
//   getBalance() {
//     return balance;
//   },
//   getDiscount() {
//     return discount;
//   },
//   setDiscount(value) {
//     discount = value;
//   },
//   getOrders() {
//     return orders;
//   },
//   addOrder(cost, order) {
//     balance -= cost - cost * discount;
//     orders.push(order);
//   },
//   // Change code above this line
// };

// customer.setDiscount(0.15);
// console.log(customer.getDiscount()); // 0.15
// customer.addOrder(5000, "Steak");
// console.log(customer.getBalance()); // 19750
// console.log(customer.getOrders()); // ["Burger", "Pizza", "Salad", "Steak"]

//--SOLUTION 2---------------------------------------------------
// const customer = {
//   username: "Mango",
//   balance: 24000,
//   discount: 0.1,
//   orders: ["Burger", "Pizza", "Salad"],
//   // Change code below this line
//   getBalance() {
//     return this.balance;
//   },
//   getDiscount() {
//     return this.discount;
//   },
//   setDiscount(value) {
//     this.discount = value;
//   },
//   getOrders() {
//     return this.orders;
//   },
//   addOrder(cost, order) {
//     this.balance -= cost - cost * this.discount;
//     this.orders.push(order);
//   },
//   // Change code above this line
// };

// customer.setDiscount(0.15);
// console.log(customer.getDiscount()); // 0.15
// customer.addOrder(5000, "Steak");
// console.log(customer.getBalance()); // 19750
// console.log(customer.getOrders()); // ["Burger", "Pizza", "Salad", "Steak"]



//--TASK 3--------------------------------------------------------------------------------------------------------------


//--SOLUTION 3---------------------------------------------------



//--TASK 4--------------------------------------------------------------------------------------------------------------


//--SOLUTION 4---------------------------------------------------


//--TASK 5--------------------------------------------------------------------------------------------------------------


//--SOLUTION 5---------------------------------------------------


//--TASK 6--------------------------------------------------------------------------------------------------------------


//--SOLUTION 6---------------------------------------------------



//--TASK 7--------------------------------------------------------------------------------------------------------------


//--SOLUTION 7---------------------------------------------------



//--TASK 8--------------------------------------------------------------------------------------------------------------


//--SOLUTION 8---------------------------------------------------



//--TASK 9--------------------------------------------------------------------------------------------------------------


//--SOLUTION 9---------------------------------------------------



//--TASK 10--------------------------------------------------------------------------------------------------------------


//--SOLUTION 10---------------------------------------------------



//--TASK 11--------------------------------------------------------------------------------------------------------------


//--SOLUTION 11---------------------------------------------------




//--TASK 12--------------------------------------------------------------------------------------------------------------


//--SOLUTION 12---------------------------------------------------



//--TASK 13--------------------------------------------------------------------------------------------------------------


//--SOLUTION 13---------------------------------------------------




//--TASK 14--------------------------------------------------------------------------------------------------------------


//--SOLUTION 14---------------------------------------------------



//--TASK 15--------------------------------------------------------------------------------------------------------------


//--SOLUTION 15---------------------------------------------------




//--TASK 16--------------------------------------------------------------------------------------------------------------


//--SOLUTION 16---------------------------------------------------



//--TASK 17--------------------------------------------------------------------------------------------------------------


//--SOLUTION 17---------------------------------------------------



//--TASK 18--------------------------------------------------------------------------------------------------------------


//--SOLUTION 18---------------------------------------------------



//--TASK 19--------------------------------------------------------------------------------------------------------------


//--SOLUTION 19---------------------------------------------------



//--TASK 20--------------------------------------------------------------------------------------------------------------


//--SOLUTION 20---------------------------------------------------


